12/data/attachments/87d0fdac30ee5d97.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_679213f0-1ef1-4869-9c54-b1670eafb22c</nif:username>
            <nif:friendToBeAdded>Sarah_audience_Friend_34655_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>